src/DataProcessors/РабочийКалендарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>РабочийКалендарь</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Documents/Событие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Событие</Name>
			<Comment>Предварительная запись клиента</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНапоминанияДоЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДиалога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиЗаписей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеРезерва</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеренесённаяПредварительнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолисМедСтрахования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПолисыМедицинскогоСтрахования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтмены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСобытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПациента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонныйЗвонок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаРезерва</Name>
					<Comment>Цвет фона резерва</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаВремени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакЗаблокированно</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаЗаписи</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныЗаписи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/РабочийКалендарь/Forms/ФормаДиалогаПереносаПриемов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При создании на сервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ДатаНачала", 				ЭтотОбъект.НоваяДатаНачала);
	Параметры.Свойство("ДатаОкончания", 			ЭтотОбъект.НоваяДатаОкончания);
	Параметры.Свойство("Событие", 					ЭтотОбъект.ПереносимоеСобытие);
	Параметры.Свойство("Сотрудник", 				ЭтотОбъект.Сотрудник);
	Параметры.Свойство("СтруктурнаяЕдиница",		ЭтотОбъект.СтруктурнаяЕдиница);	
	Параметры.Свойство("Помещение",					ЭтотОбъект.Помещение);
	Параметры.Свойство("ВернутьВыбраннуюКоманду",	ЭтотОбъект.ВернутьВыбраннуюКоманду);
	Параметры.Свойство("ЭтоКопирование",			ЭтотОбъект.ЭтоКопирование);
	Параметры.Свойство("ЭтоПеренос",				ЭтотОбъект.ЭтоПеренос);
	
	ИнтервалЗаписи = ?(Параметры.Свойство("ИнтервалЗаписи"), Параметры.ИнтервалЗаписи, 0); 	
	ЭтотОбъект.ИнтервалЗаписи = ?(ИнтервалЗаписи = 1, 10, ?(ИнтервалЗаписи = 2, 5, ?(ИнтервалЗаписи = 3, 30, 15)));
	
	ЗаполнитьТаблицуПерекрестныхПриемов();
    ИзменитьДоступностьЭлементовФормы();
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

 &НаКлиенте
// Процедура - Сократить время приема.
//
Процедура СократитьВремяПриема(Команда)
	
	Если ЭтотОбъект.ВернутьВыбраннуюКоманду Тогда
		ВернутьПараметрИЗакрытьФорму(Команда.Имя);
		Возврат;
	КонецЕсли;
	
	ДатаНачала = Дата(1,1,1);
	ДатаОкончания = Дата(1,1,1);
	
	ЭтотОбъект.ТаблицаПереносимыхПриемов.Очистить();
	
	НоваяСтрокаПереносимыхПриемов = ЭтотОбъект.ТаблицаПереносимыхПриемов.Добавить();
	НоваяСтрокаПереносимыхПриемов.Событие = ЭтотОбъект.ПереносимоеСобытие;
	
	Если ЭтотОбъект.ТаблицаПерекрестныхПриемов.Количество() = 1 Тогда
		
		СтрокаТЗ =  ЭтотОбъект.ТаблицаПерекрестныхПриемов[0];		
		ДатаНачала = ?(ЭтотОбъект.НоваяДатаНачала > СтрокаТЗ.ДатаНачала, СтрокаТЗ.ДатаОкончания, ЭтотОбъект.НоваяДатаНачала);
		ДатаОкончания = ?(ЭтотОбъект.НоваяДатаНачала > СтрокаТЗ.ДатаНачала, ЭтотОбъект.НоваяДатаОкончания, СтрокаТЗ.ДатаНачала);	
				
	Иначе	
		
		ТЗПерекрестныхПриемов = ЭтотОбъект.ТаблицаПерекрестныхПриемов;
		СвободныйИнтервал = ПолучитьСвободныйИнтервалМеждуСобытиями(ТЗПерекрестныхПриемов, ЭтотОбъект.НоваяДатаНачала, ЭтотОбъект.НоваяДатаОкончания);
		
		Если НЕ СвободныйИнтервал.МаксДатаОкончанияВерхних = Дата(1,1,1) И НЕ СвободныйИнтервал.МинДатаНачалаНижних = Дата(3000,1,1) Тогда
			ДатаНачала = СвободныйИнтервал.МаксДатаОкончанияВерхних;	
			ДатаОкончания = СвободныйИнтервал.МинДатаНачалаНижних;
		КонецЕсли;
				
	КонецЕсли;	
			
	Если ЭтотОбъект.ЭтоКопирование Тогда
		
		ВозвращаемыйПараметр = Новый Структура("Команда, ДатаНачала, ДатаОкончания", "СократитьВремяПриема", ДатаНачала, ДатаОкончания);		
		ВернутьПараметрИЗакрытьФорму(ВозвращаемыйПараметр);	
		Возврат;
		
	КонецЕсли;
	
	НоваяСтрокаПереносимыхПриемов.ДатаНачала = ДатаНачала;
	НоваяСтрокаПереносимыхПриемов.ДатаОкончания = ДатаОкончания;
	
	ПеренестиСобытияИОбновитьПланировщик();	
		
КонецПроцедуры

&НаКлиенте
// Процедура - Освободить время приема.
//
Процедура ОсвободитьВремяПриема(Команда)
	
	Если ЭтотОбъект.ВернутьВыбраннуюКоманду Тогда
		ВернутьПараметрИЗакрытьФорму(Команда.Имя);
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.ТаблицаПереносимыхПриемов.Очистить();
	
	Для Каждого СтрокаТЗ Из ЭтотОбъект.ТаблицаПерекрестныхПриемов Цикл
		
		Если НЕ СтрокаТЗ.ТипПерекрытия = 3 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаПереносимыхПриемов = ЭтотОбъект.ТаблицаПереносимыхПриемов.Добавить();
		НоваяСтрокаПереносимыхПриемов.Событие = СтрокаТЗ.Событие;
				
		ОдинаковаяГраницаВремени = ((СтрокаТЗ.ДатаНачала = ЭтотОбъект.НоваяДатаНачала) ИЛИ (СтрокаТЗ.ДатаОкончания = ЭтотОбъект.НоваяДатаОкончания));
		
		Если НЕ ОдинаковаяГраницаВремени И СтрокаТЗ.ДатаОкончания > ЭтотОбъект.НоваяДатаОкончания Тогда
			
			НоваяСтрокаПереносимыхПриемов.ДатаНачала	= СтрокаТЗ.ДатаНачала + ?(ОдинаковаяГраницаВремени, 0, СтрокаТЗ.ПерекрываемоеВремя * 60);
			НоваяСтрокаПереносимыхПриемов.ДатаОкончания	= СтрокаТЗ.ДатаОкончания - ?(ОдинаковаяГраницаВремени, СтрокаТЗ.ПерекрываемоеВремя * 60, 0);
			
		ИначеЕсли НЕ ОдинаковаяГраницаВремени И СтрокаТЗ.ДатаНачала < ЭтотОбъект.НоваяДатаНачала Тогда
			
			НоваяСтрокаПереносимыхПриемов.ДатаНачала	= СтрокаТЗ.ДатаНачала + ?(ОдинаковаяГраницаВремени, СтрокаТЗ.ПерекрываемоеВремя * 60, 0);
			НоваяСтрокаПереносимыхПриемов.ДатаОкончания	= СтрокаТЗ.ДатаОкончания - ?(ОдинаковаяГраницаВремени, 0, СтрокаТЗ.ПерекрываемоеВремя * 60);				
			
		ИначеЕсли ОдинаковаяГраницаВремени Тогда
			
			НоваяСтрокаПереносимыхПриемов.ДатаНачала	= СтрокаТЗ.ДатаНачала + ?(СтрокаТЗ.ДатаНачала = ЭтотОбъект.НоваяДатаНачала, СтрокаТЗ.ПерекрываемоеВремя * 60, 0);
			НоваяСтрокаПереносимыхПриемов.ДатаОкончания	= СтрокаТЗ.ДатаОкончания - ?(СтрокаТЗ.ДатаОкончания = ЭтотОбъект.НоваяДатаОкончания, СтрокаТЗ.ПерекрываемоеВремя * 60, 0);		
						
		КонецЕсли;
		
	КонецЦикла;	
	
	Если НЕ ЭтотОбъект.ЭтоКопирование Тогда
		ДобавитьВТаблицуПереносимыхТекущийПрием();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ТаблицаПереносимыхПриемов) Тогда 	
		ПеренестиСобытияИОбновитьПланировщик();	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - Перенести как есть.
//
Процедура ПеренестиКакЕсть(Команда)
	
	Если ЭтотОбъект.ВернутьВыбраннуюКоманду ИЛИ ЭтотОбъект.ЭтоКопирование Тогда
		ВернутьПараметрИЗакрытьФорму(Команда.Имя);
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.ТаблицаПереносимыхПриемов.Очистить();	
	ДобавитьВТаблицуПереносимыхТекущийПрием();
	ПеренестиСобытияИОбновитьПланировщик();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура - Добавить в таблицу переносимых текущий прием.
//
Процедура ДобавитьВТаблицуПереносимыхТекущийПрием()
	
	НоваяСтрокаПереносимыхПриемов = ЭтотОбъект.ТаблицаПереносимыхПриемов.Добавить();
	НоваяСтрокаПереносимыхПриемов.Событие = ЭтотОбъект.ПереносимоеСобытие;
	НоваяСтрокаПереносимыхПриемов.ДатаНачала = ЭтотОбъект.НоваяДатаНачала;
	НоваяСтрокаПереносимыхПриемов.ДатаОкончания = ЭтотОбъект.НоваяДатаОкончания;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Перенести события и обновить планировщик.
//
Процедура ПеренестиСобытияИОбновитьПланировщик()
	
	ТЗПереносимыхПриемов = ЭтотОбъект.ТаблицаПереносимыхПриемов;
	ПеренестиСобытия(ТЗПереносимыхПриемов, ЭтотОбъект.Сотрудник, ЭтотОбъект.Помещение);	
	ВернутьПараметрИЗакрытьФорму(?(ЭтотОбъект.ЭтоКопирование, "ПеренестиКакЕсть", "ОбновлениеСтраницыЖурналПредварительнойЗаписи"));
	
КонецПроцедуры

&НаКлиенте
// Процедура - Вернуть команду и закрыть форму.
//
Процедура ВернутьПараметрИЗакрытьФорму(ВозвращаемыйПараметр = Неопределено)

	ЭтаФорма.Закрыть(ВозвращаемыйПараметр);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура - Перенести события из ТЗ ТаблицаПереносимыхПриемов.
//
Процедура ПеренестиСобытия(ТаблицаПереносимыхПриемов, Сотрудник, Помещение = Неопределено)
	
	Для Каждого ПереносимыйПрием Из ТаблицаПереносимыхПриемов Цикл
		Документы.Событие.ПеренестиПредварительнуюЗапись(ПереносимыйПрием.Событие, Сотрудник, Помещение, ПереносимыйПрием.ДатаНачала, ПереносимыйПрием.ДатаОкончания, Истина); 		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
// Функция - Просчитать время перекрытия событий.
// 
Функция ПросчитатьВремяПерекрытияСобытий()	
	
	// Типы перекрытий:
	// 1 - Полностью перекрывает.
	// 2 - Свободный промежуток меньше одной строки журнала.
	// 3 - Частичное перекрытие, остается 1 и более строк журнала.
	
	ДлительностьПереносимогоПриема = ЭтотОбъект.НоваяДатаОкончания - ЭтотОбъект.НоваяДатаНачала;
	
	Для Каждого СтрокаТЗ Из ЭтотОбъект.ТаблицаПерекрестныхПриемов Цикл
		
		Перекрытие = 0;
		
		Если (СтрокаТЗ.ДатаНачала <= ЭтотОбъект.НоваяДатаНачала И СтрокаТЗ.ДатаОкончания >= ЭтотОбъект.НоваяДатаОкончания) ИЛИ
			 (СтрокаТЗ.ДатаНачала >= ЭтотОбъект.НоваяДатаНачала И СтрокаТЗ.ДатаОкончания <= ЭтотОбъект.НоваяДатаОкончания) Тогда						 
			 
			Если (НЕ СтрокаТЗ.ДатаОкончания - СтрокаТЗ.ДатаНачала = ДлительностьПереносимогоПриема) И 
					(ЭтотОбъект.НоваяДатаНачала = СтрокаТЗ.ДатаНачала ИЛИ ЭтотОбъект.НоваяДатаОкончания = СтрокаТЗ.ДатаОкончания) Тогда	 
					
				Перекрытие = ДлительностьПереносимогоПриема / 60;	
			Иначе
				Перекрытие = СтрокаТЗ.Длительность;
			КонецЕсли;
			
		ИначеЕсли СтрокаТЗ.ДатаНачала > ЭтотОбъект.НоваяДатаНачала И СтрокаТЗ.ДатаОкончания > ЭтотОбъект.НоваяДатаОкончания Тогда			
			Перекрытие = (ЭтотОбъект.НоваяДатаОкончания - СтрокаТЗ.ДатаНачала) / 60;							
		ИначеЕсли СтрокаТЗ.ДатаНачала < ЭтотОбъект.НоваяДатаНачала И СтрокаТЗ.ДатаОкончания < ЭтотОбъект.НоваяДатаОкончания Тогда				
			Перекрытие = (СтрокаТЗ.ДатаОкончания - ЭтотОбъект.НоваяДатаНачала) / 60;									
		КонецЕсли;	
		
		СтрокаТЗ.ПерекрываемоеВремя = Перекрытие;
		СтрокаТЗ.ТипПерекрытия = ?(Перекрытие = СтрокаТЗ.Длительность, 1, ?(СтрокаТЗ.Длительность - Перекрытие < ИнтервалЗаписи, 2, 3)); 			
		
	КонецЦикла;	
		
КонецФункции

&НаСервере
// Процедура - Изменить доступность элементов формы.
//
Процедура ИзменитьДоступностьЭлементовФормы()
	
	ОсвободитьВремяДоступна = Ложь;
	СократитьПриемДоступна = Ложь;
	
	КоличествоПерекрестныхПриемов = ЭтотОбъект.ТаблицаПерекрестныхПриемов.Количество();																									
	
	Если КоличествоПерекрестныхПриемов > 0 Тогда																				
		
		ПросчитатьВремяПерекрытияСобытий();
		
		КолвоПриемовСТипом3 = ЭтотОбъект.ТаблицаПерекрестныхПриемов.НайтиСтроки(Новый Структура("ТипПерекрытия", 3)).Количество();
		
		Если КоличествоПерекрестныхПриемов = 1 Тогда
			
			СтрокаТЗ = ЭтотОбъект.ТаблицаПерекрестныхПриемов[0];							
			ЕстьСвоободнаяСтрока = ((ЭтотОбъект.НоваяДатаОкончания - СтрокаТЗ.ДатаОкончания) / 60 >= ЭтотОбъект.ИнтервалЗаписи ИЛИ
			(СтрокаТЗ.ДатаНачала - ЭтотОбъект.НоваяДатаНачала) / 60 >= ЭтотОбъект.ИнтервалЗаписи);								
			
			ОсвободитьВремяДоступна = (СтрокаТЗ.ТипПерекрытия = 3);
			СократитьПриемДоступна = (ОсвободитьВремяДоступна И ЕстьСвоободнаяСтрока);
			
		ИначеЕсли КолвоПриемовСТипом3 = КоличествоПерекрестныхПриемов Тогда					
			
			// Если все приемы частично-перекрыты.
			ОсвободитьВремяДоступна = Истина;  									
			СократитьПриемДоступна = ВозможноСокращениеВремениСобытия();
			
		КонецЕсли;		
		
	КонецЕсли;
	
	Элементы.КомандаОсвободитьВремяДляПриема.Доступность = ОсвободитьВремяДоступна;
	Элементы.КомандаСократитьВремяПриема.Доступность = СократитьПриемДоступна;
	
	ЭтоВставка = (ЭтотОбъект.ЭтоКопирование = Истина);
	ЭтаФорма.Заголовок = ?(ЭтоВставка, "Как вставить?", "Как перенести?"); 
	Если НЕ ЭтотОбъект.ЭтоКопирование И НЕ ЭтотОбъект.ЭтоПеренос Тогда
		Элементы.КомандаПеренестиКакЕсть.Видимость = Ложь;
		ЭтаФорма.Заголовок = "Как записать?";
	КонецЕсли;
	Элементы.КомандаПеренестиКакЕсть.Заголовок = ?(ЭтоВставка, " Вставить", " Перенести") + " как есть                   " + ?(ЭтоВставка, "  ", "");	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция - Получить свободный интервал между событиями.
// 
Функция ПолучитьСвободныйИнтервалМеждуСобытиями(ТаблицаПерекрестныхПриемов, НоваяДатаНачала, НоваяДатаОкончания)
	
	МаксДатаОкончанияВерхних = Дата(1,1,1);
	МинДатаНачалаНижних = Дата(3000,1,1);	
	
	Для Каждого СтрокаТЗ Из ТаблицаПерекрестныхПриемов Цикл
		
		Если СтрокаТЗ.ДатаНачала < НоваяДатаНачала И СтрокаТЗ.ДатаОкончания > МаксДатаОкончанияВерхних Тогда			
			МаксДатаОкончанияВерхних = СтрокаТЗ.ДатаОкончания;				
		ИначеЕсли СтрокаТЗ.ДатаОкончания > НоваяДатаОкончания И СтрокаТЗ.ДатаНачала < МинДатаНачалаНижних Тогда
			МинДатаНачалаНижних = СтрокаТЗ.ДатаНачала;			
		КонецЕсли;	
		
	КонецЦикла;
	
	// Чтоб не делать еще проверки. Вверху или внизу может не быть событий, но нужно получить границу вставки!
	
	МинДатаНачалаНижних = ?(МинДатаНачалаНижних = Дата(3000,1,1), НоваяДатаОкончания, МинДатаНачалаНижних);
	МаксДатаОкончанияВерхних = ?(МаксДатаОкончанияВерхних = Дата(1,1,1), НоваяДатаНачала, МаксДатаОкончанияВерхних);
	
	Возврат Новый Структура("МаксДатаОкончанияВерхних, МинДатаНачалаНижних", МаксДатаОкончанияВерхних, МинДатаНачалаНижних);
	
КонецФункции

&НаСервере
// Функция - Возможно сокращение времени события.
// 
Функция ВозможноСокращениеВремениСобытия()
	
	ТЗПерекрестныхПриемов = ЭтотОбъект.ТаблицаПерекрестныхПриемов;
	СвободныйИнтервал = ПолучитьСвободныйИнтервалМеждуСобытиями(ТЗПерекрестныхПриемов, ЭтотОбъект.НоваяДатаНачала, ЭтотОбъект.НоваяДатаОкончания);
	
	Если НЕ СвободныйИнтервал.МаксДатаОкончанияВерхних = Дата(1,1,1) И НЕ СвободныйИнтервал.МинДатаНачалаНижних = Дата(3000,1,1) Тогда		
		РезультатПроверки = ((СвободныйИнтервал.МинДатаНачалаНижних - СвободныйИнтервал.МаксДатаОкончанияВерхних) / 60) >= ЭтотОбъект.ИнтервалЗаписи;	
	Иначе		
		РезультатПроверки = Ложь;		
	КонецЕсли;
		
	Возврат РезультатПроверки;
	
КонецФункции

&НаСервере
// Процедура - Заполнить таблицу перекрестных приемов.
//
Процедура ЗаполнитьТаблицуПерекрестныхПриемов()

	ЭтотОбъект.ТаблицаПерекрестныхПриемов.Загрузить(Документы.Событие.ВернутьСобытияЗаУказанныйПериод(ЭтотОбъект.НоваяДатаНачала,
																										ЭтотОбъект.НоваяДатаОкончания,
																										ЭтотОбъект.СтруктурнаяЕдиница,
																										ЭтотОбъект.Сотрудник,
																										ЭтотОбъект.Помещение,
																										ЭтотОбъект.ПереносимоеСобытие));
	
КонецПроцедуры

#КонецОбласти
